YanqiS/stm32temp1/main.c
/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_FDCAN1_Init(void);
static void MX_FDCAN2_Init(void);
static void MX_I2C1_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_CRC_Init(void);
static void MX_I2C3_Init(void);
static void MX_SPI1_Init(void);
static void MX_TIM6_Init(void);
static void MX_TIM7_Init(void);
static void MX_TIM14_Init(void);
static void MX_ADC1_Init(void);
static void MX_TIM16_Init(void);
static void MX_TIM17_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM15_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM4_Init(void);
/* USER CODE BEGIN PFP */
void UART_RESET(UART_HandleTypeDef *huart);
void UART_Init(UART_HandleTypeDef *huart, uint32_t data_length);
void LIN_RESET(UART_HandleTypeDef *huart);
uint8_t Lin_CheckPID(uint8_t id);
uint8_t Lin_Checksum(uint8_t id, uint8_t data[]);
uint8_t Calc_SWS_G3_CRC8(const uint8_t *data, uint8_t len);
void Build_EBS_0x34_Data(void);
void Build_EBS_0x35_Data(void);
void Build_EBS_0x36_Data(void);
void Lin_SendData(uint8_t *data);
void Lin_DataProcess_loop(void);

void SPI_Stop(SPI_HandleTypeDef *hspi);
void SPI_Flash_Start(SPI_HandleTypeDef *hspi);
void SPI_TFT_Start(SPI_HandleTypeDef *hspi);

void Ser2CAN(void);
uint32_t mRead_ADC1_ch(uint8_t ch);
void Sys_tune1();
void Sys_tuneX(uint32_t fq);
uint32_t PWMServo_Ag2Pulse(uint32_t ag);
void PWMServo2_3_AGout(uint32_t ag);
void PWMServo2_4_AGout(uint32_t ag);
void PWMServo3_1_AGout(uint32_t ag);
void PWMServo3_2_AGout(uint32_t ag);
void MoC_Init();
void MotoCtrl_PackSend12();
//void MotoCtrl_PackSend2();
void MotoCtrl_PackSend3();
void MotoCtrl_PackSend4();
void MotoCtrl_PositionLoop(int PositionX_mm, int PositionY_mm);
bool WaitMotorToTargetWithProtection(uint32_t timeout_ms, uint16_t poll_ms,
		bool trigger_emergency);
//void CAN2Ser_Config(void);
void Set_SystemReboot();
void Clamp_Position(int *x, int *y, bool allow_reset);
void Door_Control(void);
uint8_t ByteEncryp(uint8_t byteData);

void Motor_Protection_Init(void);
void Motor_Protection_Reset(void);
uint8_t Motor_Protection_Check(int16_t current_X, int16_t current_Y,
		int16_t target_X, int16_t target_Y);
void Motor_Protection_EmergencyStop(void);

/* ====================== 可交接功能函数（中文注释） ====================== */
// 开机流程：执行 Flash 自检 + 读取 UID（A 版本）
static void Boot_RunFlashSelfTest_AndLoadUID(char *str_buf);
// 开机流程：跳过 Flash 自检（B 版本）
static void Boot_SkipFlashSelfTest(void);
// OLED 第4行：显示 LIN RID 收包状态
static void OLED_ShowRIDFlagsLine(uint8_t row, char *oled_line);
// OLED 运行页：id1==0（非 MoC）
static void OLED_UpdatePage_Id0(char *oled_line);
// OLED 运行页：id1==1（MoC）
static void OLED_UpdatePage_Id1(char *oled_line);
// LIN 工具：重启 USART3 的 LIN 接收
static void Lin_RearmUart3(void);
// LIN 工具：处理常见 RID（22/34/35/36），返回 true 表示已处理
static bool Lin_HandleKnownRid(uint8_t rid);
// LIN 工具：各 RID 独立处理函数（便于交接和扩展）
static void Lin_HandleRid22(void);
static void Lin_HandleRid34(void);
static void Lin_HandleRid35(void);
static void Lin_HandleRid36(void);
// LIN 工具：处理未知 RID 的通用流程
static void Lin_HandleUnknownRid(void);
// LIN 工具：从 USART3 读取本次接收字节/帧
static void Lin_ReadRxDataFromUart3(void);
// LIN 工具：更新本次接收的调试状态
static void Lin_UpdateDebugOnRx(void);
// UART 工具：按句柄重启接收（用于 huart1/2/3）
static void Uart_RearmByHandle(UART_HandleTypeDef *huart);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void) {

	/* USER CODE BEGIN 1 */

	/* USER CODE END 1 */

	/* MCU Configuration--------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	/* USER CODE BEGIN Init */

	/* USER CODE END Init */

	/* Configure the system clock */
	SystemClock_Config();

	/* USER CODE BEGIN SysInit */

	/* USER CODE END SysInit */

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	MX_DMA_Init();
	MX_FDCAN1_Init();
	MX_FDCAN2_Init();
	MX_I2C1_Init();
	MX_USART1_UART_Init();
	MX_CRC_Init();
	MX_I2C3_Init();
	MX_SPI1_Init();
	MX_TIM6_Init();
	MX_TIM7_Init();
	MX_TIM14_Init();
	MX_ADC1_Init();
	MX_TIM16_Init();
	MX_TIM17_Init();
	MX_TIM1_Init();
	MX_TIM15_Init();
	MX_USART3_UART_Init();
	MX_USART2_UART_Init();
	MX_TIM2_Init();
	MX_TIM3_Init();
	MX_TIM4_Init();
	/* USER CODE BEGIN 2 */

	///////use OLED for debug msg display
	HAL_Delay(300);
	OLED_Init(OLED_I2C_ch, OLED_type);
	OLED_Fill(OLED_I2C_ch, OLED_type, 0xff);
	HAL_Delay(1000);
	OLED_Fill(OLED_I2C_ch, OLED_type, 0x00);
	HAL_Delay(1000);

	HAL_FDCAN_MspInit(&hfdcan1);
	HAL_FDCAN_MspInit(&hfdcan2);

	Flash_SPI = &hspi1;
	TFT_SPI = &hspi1;

	TSA_Ack_Header.Identifier = 0x531;
	TSA_Ack_Header.DataLength = FDCAN_DLC_BYTES_8;
	TSA_Ack_Header.FDFormat = FDCAN_CLASSIC_CAN;	//FDCAN_FD_CAN;
	TSA_Ack_Header.BitRateSwitch = FDCAN_BRS_OFF;	//FDCAN_BRS_ON; //
	TSA_Ack_Header.TxFrameType = FDCAN_DATA_FRAME;///*!< Data frame > < Remote frame */
	TSA_Ack_Header.IdType = FDCAN_STANDARD_ID;
	TSA_Ack_Header.ErrorStateIndicator = FDCAN_ESI_PASSIVE;
	TSA_Ack_Header.TxEventFifoControl = FDCAN_NO_TX_EVENTS;
	TSA_Ack_Header.MessageMarker = 0;

	TSA2_LS_Header.Identifier = 0x51;
	TSA2_LS_Header.DataLength = FDCAN_DLC_BYTES_8;
	TSA2_LS_Header.FDFormat = FDCAN_CLASSIC_CAN;	//FDCAN_FD_CAN;
	TSA2_LS_Header.BitRateSwitch = FDCAN_BRS_OFF;	//FDCAN_BRS_ON; //
	TSA2_LS_Header.TxFrameType = FDCAN_DATA_FRAME;///*!< Data frame > < Remote frame */
	TSA2_LS_Header.IdType = FDCAN_STANDARD_ID;
	TSA2_LS_Header.ErrorStateIndicator = FDCAN_ESI_PASSIVE;
	TSA2_LS_Header.TxEventFifoControl = FDCAN_NO_TX_EVENTS;
	TSA2_LS_Header.MessageMarker = 0;

	TSA1_ADC_Header.Identifier = 0x50;
	TSA1_ADC_Header.DataLength = FDCAN_DLC_BYTES_8;
	TSA1_ADC_Header.FDFormat = FDCAN_CLASSIC_CAN;	//FDCAN_FD_CAN;
	TSA1_ADC_Header.BitRateSwitch = FDCAN_BRS_OFF;	//FDCAN_BRS_ON; //
	TSA1_ADC_Header.TxFrameType = FDCAN_DATA_FRAME;	///*!< Data frame > < Remote frame */
	TSA1_ADC_Header.IdType = FDCAN_STANDARD_ID;
	TSA1_ADC_Header.ErrorStateIndicator = FDCAN_ESI_PASSIVE;
	TSA1_ADC_Header.TxEventFifoControl = FDCAN_NO_TX_EVENTS;
	TSA1_ADC_Header.MessageMarker = 0;

	TSA_GP_IN_Header.Identifier = 0x110;
	TSA_GP_IN_Header.DataLength = FDCAN_DLC_BYTES_8;
	TSA_GP_IN_Header.FDFormat = FDCAN_CLASSIC_CAN;	//FDCAN_FD_CAN;
	TSA_GP_IN_Header.BitRateSwitch = FDCAN_BRS_OFF;	//FDCAN_BRS_ON; //
	TSA_GP_IN_Header.TxFrameType = FDCAN_DATA_FRAME;///*!< Data frame > < Remote frame */
	TSA_GP_IN_Header.IdType = FDCAN_STANDARD_ID;
	TSA_GP_IN_Header.ErrorStateIndicator = FDCAN_ESI_PASSIVE;
	TSA_GP_IN_Header.TxEventFifoControl = FDCAN_NO_TX_EVENTS;
	TSA_GP_IN_Header.MessageMarker = 0;

	// M1电机
	MotrCtrl_1_TxHeader.Identifier = M1_ID;  // ← 关键！0x0D1
	MotrCtrl_1_TxHeader.IdType = FDCAN_STANDARD_ID;
	MotrCtrl_1_TxHeader.TxFrameType = FDCAN_DATA_FRAME;
	MotrCtrl_1_TxHeader.DataLength = FDCAN_DLC_BYTES_8;
	MotrCtrl_1_TxHeader.ErrorStateIndicator = FDCAN_ESI_PASSIVE;
	MotrCtrl_1_TxHeader.BitRateSwitch = FDCAN_BRS_OFF;
	MotrCtrl_1_TxHeader.FDFormat = FDCAN_CLASSIC_CAN;
	MotrCtrl_1_TxHeader.TxEventFifoControl = FDCAN_NO_TX_EVENTS;
	MotrCtrl_1_TxHeader.MessageMarker = 0;

