YanqiS/stm32temp1/main.c
//	  HAL_Delay(500);

	/* ====================== 开机 Flash 检测 A/B 版本切换 ======================
	 * A 版本（推荐调试）: 执行 Flash 读写自检 + 读取 UID
	 * B 版本（快速启动）: 跳过 Flash 自检，直接给默认 EncrypKey
	 * 只需修改 CFG_BOOT_FLASH_SELF_TEST_EN 即可切换
	 */
#if CFG_BOOT_FLASH_SELF_TEST_EN
	Boot_RunFlashSelfTest_AndLoadUID(str1);
#else
	/* B 版本：跳过 Flash 检测，适合快速上电验证 */
	Boot_SkipFlashSelfTest();
#endif
////

//// ADC
	HAL_Delay(50);
	if (HAL_ADCEx_Calibration_Start(&hadc1) != HAL_OK) {
		char *str0 = "ADC_Calib_Error! ";
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, str0);
		// 校准失败，处理错�????????????????????????????????????????????????????????
		Error_Handler();
		while (1)
			;
	}

	MX_DMA_Init();
	HAL_Delay(20);
	HAL_ADC_Start_DMA(&hadc1, (uint32_t*) adc_buffer, ADC_CHANNELS);

	SPI_Stop(Flash_SPI);
	HAL_Delay(10);
	SPI_TFT_Start(Flash_SPI);
	HAL_Delay(50);

	ST7789_Init();
	HAL_Delay(100);

	ST7789_Flush(TFT_RED);
	HAL_Delay(200);
	ST7789_Flush(TFT_GREEN);
	HAL_Delay(200);
	ST7789_Flush(TFT_BLUE);
	HAL_Delay(200);

//    Sys_tune1();	//1000

	for (int i = 10; i > 3; i--) {
//    	Sys_tuneX(i*300);
		HAL_Delay(100);
	}

	HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_3);
	HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_4);
	HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1);
	HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_2);
	PWMServo2_3_AGout(0);
	PWMServo2_4_AGout(0);
	PWMServo3_1_AGout(0);
	PWMServo3_2_AGout(0);

	if (id1 == 1)	//MoC
			{
		MoC_Init();
	} else {
		lvLED_Sts_TPRobot = 0;
	}

//    Set_SystemReboot();

// 启动LIN接收
	HAL_UART_Receive_IT(&huart1, u1RxData, LIN_Data_LENGTH);
	HAL_UART_Receive_IT(&huart2, u2RxData, LIN_Data_LENGTH);
	HAL_UART_Receive_IT(&huart3, u3RxData, LIN_Data_LENGTH);

////// LIN init

	HAL_GPIO_WritePin(LIN1_EN_GPIO_Port, LIN1_EN_Pin, 1);
	HAL_GPIO_WritePin(LIN2_EN_GPIO_Port, LIN2_EN_Pin, 1);
	HAL_GPIO_WritePin(LIN3_EN_GPIO_Port, LIN3_EN_Pin, 1);
//	// 解除LIN收发器复位（NRES低电平有效，拉高解除复位）
//	HAL_GPIO_WritePin(LIN1_NRES_GPIO_Port, LIN1_NRES_Pin, 1);
//	HAL_GPIO_WritePin(LIN2_NRES_GPIO_Port, LIN2_NRES_Pin, 1);
//	HAL_GPIO_WritePin(LIN3_NRES_GPIO_Port, LIN3_NRES_Pin, 1);

//	////Init XL9555
//	XL9555_Init( XL9555_1_addr_write , 1 , 1 );	//in in //out out
//	XL9555_Init( XL9555_2_addr_write , 1 , 1 );	//in in //out out

///////////lvgl Init
	lv_init();

	lv_port_disp_init();
	lv_port_indev_init();

	////// use gui_guider
	setup_ui(&guider_ui);
	events_init(&guider_ui);

	itoa(Version_A, str1, 10);
	lv_label_set_text(guider_ui.screen_label_A, str1);
	itoa(Version_B, str1, 10);
	lv_label_set_text(guider_ui.screen_label_B, str1);
	itoa(Version_C, str1, 10);
	lv_label_set_text(guider_ui.screen_label_C, str1);

	SPI_Stop(Flash_SPI);
	HAL_Delay(10);
	SPI_TFT_Start(Flash_SPI);
	HAL_Delay(50);

	lv_task_handler();

	Motor_Protection_Init();

	while (1) {
		Door_Control();

		if (Remote_state == 1)	//LIN simulate or real
				{
			HAL_GPIO_WritePin(LIN_RELAY_GPIO_Port, LIN_RELAY_Pin, 1);

		} else {
			HAL_GPIO_WritePin(LIN_RELAY_GPIO_Port, LIN_RELAY_Pin, 0);
		}

		Lin_DataProcess_loop();

		if (id1 == 1)	//MoC
				{
//			////
//			OLED_ShowString(OLED_I2C_ch ,OLED_type,0, 1, "Rds x");
//			itoa(TA531_RC1_x_ready ,str1,10);
//			OLED_ShowString(OLED_I2C_ch ,OLED_type,5, 1, str1);
//			OLED_ShowString(OLED_I2C_ch ,OLED_type,6, 1, "y");
//			itoa(TA531_RC1_y_ready ,str1,10);
//			OLED_ShowString(OLED_I2C_ch ,OLED_type,7, 1, str1);
//			OLED_ShowString(OLED_I2C_ch ,OLED_type,8, 1, "z");
//			itoa(TA531_RC1_z_ready ,str1,10);
//			OLED_ShowString(OLED_I2C_ch ,OLED_type,9, 1, str1);
//			OLED_ShowString(OLED_I2C_ch ,OLED_type,12, 1, "Fg");
//			itoa(TA531_RC1_fg ,str1,10);
//			OLED_ShowString(OLED_I2C_ch ,OLED_type,15, 1, str1);

			if ((TA531_RC1.TA531_RC_X_act == TA531_RC1.TA531_RC_X_trg)) {
				TA531_RC1_x_ready = 1;
			} else {
				TA531_RC1_x_ready = 0;
			}
			if ((TA531_RC1.TA531_RC_Y_act == TA531_RC1.TA531_RC_Y_trg)) {
				TA531_RC1_y_ready = 1;
			} else {
				TA531_RC1_y_ready = 0;
			}

			Motor_Protection_Reset();
			Motor_Protection.last_X_pos = TA531_RC1.TA531_RC_X_act;
			Motor_Protection.last_Y_pos = TA531_RC1.TA531_RC_Y_act;

			while ((TA531_RC1_fg == 2)
					& ((TA531_RC1_x_ready & TA531_RC1_y_ready) != 1)) {
				MotoCtrl_PositionLoop(TA531_RC1.TA531_RC_X_trg,
						TA531_RC1.TA531_RC_Y_trg);

//				itoa(TA531_RC1.TA531_RC_X_trg ,str1,10);
//				OLED_ShowString(OLED_I2C_ch ,OLED_type,6, 2, str1);
//				itoa(TA531_RC1.TA531_RC_Y_trg ,str1,10);
//				OLED_ShowString(OLED_I2C_ch ,OLED_type,12, 2, str1);

				HAL_Delay(MOTOR_LOOP_INTERVAL_MS);

				uint8_t protection_status = Motor_Protection_Check(
						TA531_RC1.TA531_RC_X_act, TA531_RC1.TA531_RC_Y_act,
						TA531_RC1.TA531_RC_X_trg, TA531_RC1.TA531_RC_Y_trg);

				if (protection_status != 0) {
					Motor_Protection_EmergencyStop();
					break;
				}

				if ((TA531_RC1.TA531_RC_X_act == TA531_RC1.TA531_RC_X_trg)) {
					TA531_RC1_x_ready = 1;
				} else {
					TA531_RC1_x_ready = 0;
				}
				if ((TA531_RC1.TA531_RC_Y_act == TA531_RC1.TA531_RC_Y_trg)) {
					TA531_RC1_y_ready = 1;
				} else {
					TA531_RC1_y_ready = 0;
				}
			}

			if ((TA531_RC1_x_ready == 1) & (TA531_RC1_y_ready == 1)
					& (TA531_RC1_fg < 3)) {	//reach 1st point

//				itoa(TA531_RC1.TA531_RC_X_act ,str1,10);
//				OLED_ShowString(OLED_I2C_ch ,OLED_type,6, 3, str1);
//				itoa(TA531_RC1.TA531_RC_Y_act ,str1,10);
//				OLED_ShowString(OLED_I2C_ch ,OLED_type,12, 3, str1);

				if (TA531_RC1.TA531_RC_Z_code > 0)//(TA531_RC1.TA531_RC_Z_code2 != TA531_RC1.TA531_RC_Z_code)
						{
					switch (TA531_RC1.TA531_RC_Z_code) {
					case 0:		//none
						HAL_GPIO_WritePin(KL15_RELAY_GPIO_Port, KL15_RELAY_Pin,
								0);
						break;
					case 1:
						HAL_GPIO_WritePin(KL15_RELAY_GPIO_Port, KL15_RELAY_Pin,
								1);	//F
						HAL_Delay(250);
						break;
					case 2:
						HAL_GPIO_WritePin(KL15_RELAY_GPIO_Port, KL15_RELAY_Pin,
								1);	//F
						HAL_Delay(500);
						break;
					case 3:
						HAL_GPIO_WritePin(KL15_RELAY_GPIO_Port, KL15_RELAY_Pin,
								1);	//F
						HAL_Delay(500);
						break;
					}

					if ((TA531_RC1.TA531_RC_X_Mov != 0)
							| (TA531_RC1.TA531_RC_Y_Mov != 0)) {
						int temp_x = (int) (TA531_RC1.TA531_RC_X_trg
								+ TA531_RC1.TA531_RC_X_Mov);
						int temp_y = (int) (TA531_RC1.TA531_RC_Y_trg
								+ TA531_RC1.TA531_RC_Y_Mov);
						Clamp_Position(&temp_x, &temp_y, false);  // ← 添加限制
						MotoCtrl_PositionLoop(temp_x, temp_y);
						HAL_Delay(500);
					}

