YanqiS/stm32temp1/main.c
			lv_task_handler();
			HAL_Delay(1);
//			SPI_Stop(Flash_SPI);
//			HAL_Delay(5);

		} else	//(temper_flag == 1)
		{
			//float temp1075_ZXD , temp1075_IPD , temp1075_LHZCU , temp1075_RHZCU , temp1075_RZCU , temp1075_Bk1 , temp1075_Bk2 , temp1075_Bk3;
			temp1075_ZXD = readTemperature(temp1075_ch, TempSensor_ADDR_ZXD);
			temp1075_ZPD = readTemperature(temp1075_ch, TempSensor_ADDR_ZPD);
			temp1075_LHZCU = readTemperature(temp1075_ch,
			TempSensor_ADDR_LHZCU);
			temp1075_RHZCU = readTemperature(temp1075_ch,
			TempSensor_ADDR_RHZCU);
			temp1075_RZCU = readTemperature(temp1075_ch, TempSensor_ADDR_RZCU);

			if (temp1075_ZXD < 10) {
				lvLED_Sts_Sensor = 0;
			} else if ((temp1075_ZXD < 50) & (temp1075_ZPD < 50)) {
				lvLED_Sts_Sensor = 1;
			} else if ((temp1075_ZXD < 75) & (temp1075_ZPD < 75)) {
				lvLED_Sts_Sensor = 2;
			} else {
				lvLED_Sts_Sensor = 3;
			}

			temp1075_ZXD_i = truncf(temp1075_ZXD);
			temp1075_ZXD_f = (temp1075_ZXD - temp1075_ZXD_i) * 100;

//			itoa(temp1075_ZXD_i,str1,10);
//			OLED_ShowString(OLED_I2C_ch ,OLED_type,0, 2, str1);
//			OLED_ShowString(OLED_I2C_ch ,OLED_type,2, 2, ".");
//			itoa(temp1075_ZXD_f,str1,10);
//			OLED_ShowString(OLED_I2C_ch ,OLED_type,3, 2, str1);

			temper_flag = 0;
		}
		if (id1 == 1)  // MoC模式下显示
				{
			OLED_UpdatePage_Id1(oled_line);
		}
		// =======================================
	}  //while

	/* USER CODE END WHILE */

	/* USER CODE BEGIN 3 */

	/* USER CODE END 3 */
}

/* ====================== 可交接功能函数实现（中文） ======================
 * 目的：把易改需求（Flash开机策略/OLED显示策略）拆成独立函数，便于交接维护。
 */
static void Boot_RunFlashSelfTest_AndLoadUID(char *str_buf) {
	uint8_t temp1[4], temp2[4];
	uint64_t UID;

	temp1[0] = 123;
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Flash Test");

	SPI_Flash_Start(Flash_SPI);
	HAL_Delay(5);
	SPI_Flash_WtritEnable();
	HAL_Delay(5);
	SPI_Flash_WriteSomeBytes(temp1, Sys_Addr_DispTest, sizeof(int));
	HAL_Delay(5);
	SPI_Flash_ReadBytes(temp2, Sys_Addr_DispTest, sizeof(int));

	while (temp1[0] != temp2[0]) {
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Flash Test Err..");
		SPI_Stop(Flash_SPI);
		HAL_Delay(5);
		SPI_Flash_Start(Flash_SPI);
		HAL_Delay(5);
		SPI_Flash_WriteSomeBytes(temp1, Sys_Addr_DispTest, sizeof(int));
		HAL_Delay(5);
		SPI_Flash_ReadBytes(temp2, Sys_Addr_DispTest, sizeof(int));

		itoa(temp1[0], str_buf, 16);
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, str_buf);
		itoa(temp1[1], str_buf, 16);
		OLED_ShowString(OLED_I2C_ch, OLED_type, 4, 2, str_buf);
		itoa(temp2[0], str_buf, 16);
		OLED_ShowString(OLED_I2C_ch, OLED_type, 8, 2, str_buf);
		itoa(temp2[1], str_buf, 16);
		OLED_ShowString(OLED_I2C_ch, OLED_type, 12, 2, str_buf);
	}

	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Flash Test OK!");
	HAL_Delay(1000);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "UniqID:");
	HAL_Delay(1);
	UID = SPI_Flash_GUID();
	SPI_Stop(Flash_SPI);

	if ((UID == 0) | ((UID & 0xffff) == 0xffff)) {
		OLED_ShowString(OLED_I2C_ch, OLED_type, 8, 1, "Error! ");
		EncrypKey = 0x36;
	} else {
		itoa(UID, str_buf, 16);
		OLED_ShowString(OLED_I2C_ch, OLED_type, 8, 1, str_buf);
		EncrypKey = UID & 0xff;
	}
	HAL_Delay(500);
}

static void Boot_SkipFlashSelfTest(void) {
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Skip Flash Test ");
	EncrypKey = 0x36;
	HAL_Delay(200);
}

static void OLED_ShowRIDFlagsLine(uint8_t row, char *oled_line) {
	snprintf(oled_line, 17, "22%c34%c35%c36%c",
			(DEBUG_RID22_Count > 0) ? 'Y' : '-',
			(DEBUG_RID34_Count > 0) ? 'Y' : '-',
			(DEBUG_RID35_Count > 0) ? 'Y' : '-',
			(DEBUG_RID36_Count > 0) ? 'Y' : '-');
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, row, oled_line);
}

static void OLED_UpdatePage_Id0(char *oled_line) {
	snprintf(oled_line, 17, "L1:%3d L2:%3d", TA531SysEnv.TA531_env_LightA1,
			TA531SysEnv.TA531_env_LightA2);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, oled_line);

	snprintf(oled_line, 17, "L3:%3d L4:%3d", TA531SysEnv.TA531_env_LightA3,
			TA531SysEnv.TA531_env_LightA4);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, oled_line);

#if CFG_OLED_SHOW_RID_FLAGS_EN
	/* A 版本：第4行显示 LIN RID 收包状态，方便联调 */
	OLED_ShowRIDFlagsLine(3, oled_line);
#else
	/* B 版本：第4行显示传统 A1/A2（不看 RID） */
	snprintf(oled_line, 17, "A1:%3d A2:%3d", TA531SysEnv.TA531_env_ADC1,
			TA531SysEnv.TA531_env_ADC2);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, oled_line);
#endif
}

static void OLED_UpdatePage_Id1(char *oled_line) {
	snprintf(oled_line, 17, "X:%4d Y:%4d", TA531_RC1.TA531_RC_X_act,
			TA531_RC1.TA531_RC_Y_act);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 0, oled_line);

	snprintf(oled_line, 17, "L1:%3d L2:%3d", TA531SysEnv.TA531_env_LightA1,
			TA531SysEnv.TA531_env_LightA2);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, oled_line);

	snprintf(oled_line, 17, "A1:%3d A2:%3d", TA531SysEnv.TA531_env_ADC1,
			TA531SysEnv.TA531_env_ADC2);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, oled_line);

#if CFG_OLED_SHOW_RID_FLAGS_EN
	/* A 版本：第4行显示 LIN RID 收包状态，方便联调 */
	OLED_ShowRIDFlagsLine(3, oled_line);
#else
	/* B 版本：保留空白，避免遮挡 MoC 调试显示 */
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "                ");
#endif
}

static void Lin_RearmUart3(void) {
	LIN_RESET(&huart3);
	HAL_UART_Receive_IT(&huart3, u3RxData, LIN_Data_LENGTH);
}

static bool Lin_HandleKnownRid(uint8_t rid) {
	if (rid == 0x22) {  // SWS response
		Lin_HandleRid22();
		return true;
	}
	if (rid == 0x34) {  // EBS_ICCLIN1_FrP00_ICC_LIN1
		Lin_HandleRid34();
		return true;
	}
	if (rid == 0x35) {  // EBS_ICCLIN1_FrP01_ICC_LIN1
		Lin_HandleRid35();
		return true;
	}
	if (rid == 0x36) {  // EBS_ICCLIN1_FrP02_ICC_LIN1
		Lin_HandleRid36();
		return true;
	}
	return false;
}

// 输入: rid=0x22，输出: 发送 SWS_0x22_Data；副作用: 清 SWS_0x22_Flag、重启LIN接收
static void Lin_HandleRid22(void) {
	DEBUG_LIN_Send_Count++;
	Lin_SendData(SWS_0x22_Data);
	SWS_0x22_Flag = 0;
	DataProcess = 0;
	Lin_RearmUart3();
}

// 输入: rid=0x34，输出: 发送 EBS_0x0_Data；副作用: 计数+重启LIN接收
static void Lin_HandleRid34(void) {
	DEBUG_RID34_Count++;
	DEBUG_LIN_Send_Count++;
	Build_EBS_0x34_Data();
	Lin_SendData(EBS_0x0_Data);
	DataProcess = 0;
	Lin_RearmUart3();
}

// 输入: rid=0x35，输出: 发送 EBS_0x1_Data；副作用: 计数+重启LIN接收
static void Lin_HandleRid35(void) {
	DEBUG_RID35_Count++;
	DEBUG_LIN_Send_Count++;
	Build_EBS_0x35_Data();
	Lin_SendData(EBS_0x1_Data);
	DataProcess = 0;
	Lin_RearmUart3();
}

