YanqiS/stm32temp1/main.c
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart) {
	if (huart != &huart3) {
		Uart_RearmByHandle(huart);
		return;
	}
	Lin_ReadRxDataFromUart3();
	Lin_UpdateDebugOnRx();

	// 常见 RID 在独立函数内处理（包含计数、打包、发送、重启接收）
	if (Lin_HandleKnownRid(ReceiveID)) {
		return;
	}

	// 未识别 RID：进入后续通用流程
	Lin_HandleUnknownRid();
}

void UART_Init(UART_HandleTypeDef *handle, uint32_t data_length) {

	if (handle == &huart1) {
		HAL_UART_Receive_IT(&huart1, u1RxData, Serial_Data_LENGTH);	//
		return;
	}
	Uart_RearmByHandle(handle);

}

void UART_RESET(UART_HandleTypeDef *handle) {

	HAL_UART_AbortReceive(handle);
	HAL_UART_AbortReceive_IT(handle);
	/* Clear RXNE interrupt flag *//* Discard the received data */
	__HAL_UART_SEND_REQ(handle, UART_RXDATA_FLUSH_REQUEST);

}
//void CAN2Ser_Config(void)
//{
//
//}

uint32_t mRead_ADC1_ch(uint8_t ch) {
	//start ADC
	HAL_ADC_Start(&hadc1);

	HAL_ADC_PollForConversion(&hadc1, 500);

	if (ch == 1) {

	} else if (ch == 2)	//```6
			{

	}

//    if (HAL_IS_BIT_SET(HAL_ADC_GetState(&hadc1), HAL_ADC_STATE_REG_EOC))//读取ADC完成标志�?????????????????????????????????????????????????????????
//    {
//        adc_value = HAL_ADC_GetValue(&hadc1);//读出ADC数�??
//
//        // 将ADC值转换为电压
//        mVoltage = adc_value  *1165 /165 * 3250/ 4095; // 12位ADC，最�?????????????????????????????????????????????????????????4095
//    }

	// 停止ADC转换
	HAL_ADC_Stop(&hadc1);

	return mVoltage;
}

bool WaitMotorToTargetWithProtection(uint32_t timeout_ms, uint16_t poll_ms,
		bool trigger_emergency) {
	uint32_t start_tick = HAL_GetTick();

	while ((abs(TA531_RC1.TA531_RC_X_act - TA531_RC1.TA531_RC_X_trg)
			> REACH_POSITION_TOLERANCE)
			|| (abs(TA531_RC1.TA531_RC_Y_act - TA531_RC1.TA531_RC_Y_trg)
					> REACH_POSITION_TOLERANCE)) {
		MotoCtrl_PositionLoop(TA531_RC1.TA531_RC_X_trg, TA531_RC1.TA531_RC_Y_trg);

		if (Motor_Protection_Check(TA531_RC1.TA531_RC_X_act,
				TA531_RC1.TA531_RC_Y_act, TA531_RC1.TA531_RC_X_trg,
				TA531_RC1.TA531_RC_Y_trg) != 0) {
			if (trigger_emergency) {
				Motor_Protection_EmergencyStop();
			}
			return false;
		}

		if ((HAL_GetTick() - start_tick) > timeout_ms) {
			Motor_Protection.protection_triggered = 1;
			Motor_Protection.error_type = 3;
			Motor_Protection.total_errors++;
			if (trigger_emergency) {
				Motor_Protection_EmergencyStop();
			}
			return false;
		}

		HAL_Delay(poll_ms);
	}

	return true;
}

void MoC_Init() {
	////42 MotorCtrl init
	SPI_Stop(Flash_SPI);
	HAL_Delay(10);
	SPI_Flash_Start(Flash_SPI);
	HAL_Delay(10);
	MotorInit_M1 = 0;
	MotorInit_M2 = 0;
	MotorInit_M3 = 0;
	MotorInit_M4 = 0;

	MotorCtrl_M1.MotorCtrl_HostID = HostID;
	MotorCtrl_M1.MotorCtrl_FuncType = 0x01;
	MotorCtrl_M1.MotorCtrl_FuncCode = 0x01;
	MotorCtrl_M1.MotorCtrl_ByteData = 0x01;		//06/07
	MotorCtrl_M1.MotorCtrl_DataCode = 0x000000;

	MotorCtrl_M2.MotorCtrl_HostID = HostID;
	MotorCtrl_M2.MotorCtrl_FuncType = 0x01;
	MotorCtrl_M2.MotorCtrl_FuncCode = 0x01;
	MotorCtrl_M2.MotorCtrl_ByteData = 0x01;		//06/07
	MotorCtrl_M2.MotorCtrl_DataCode = 0x000000;

	MotorInit_M1 = 1;	//init wait
	MotorInit_M2 = 1;	//init wait
	MotoCtrl_PackSend12();
	HAL_Delay(MOTOR_INIT_RETRY_MS);

	while ((MotorInit_M1 != 2) | (MotorInit_M2 != 2)) {
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "M1&2 Init Wait ");
		HAL_Delay(MOTOR_INIT_RETRY_MS);
		MotoCtrl_PackSend12();
	}

	char str1[16] = { 0 };

	OLED_ShowString(OLED_I2C_ch, OLED_type, 9, 0, "1 2");	// 9 11 13 15
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "M1&2 Init ok! ");

	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, "X: ");
	itoa(M1_ID, str1, 16);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 4, 2, str1);
	itoa(TA531_RC1.TA531_RC_X_act, str1, 10);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 8, 2, str1);

	MotorCtrl_M3.MotorCtrl_HostID = HostID;
	MotorCtrl_M3.MotorCtrl_FuncType = 0x01;
	MotorCtrl_M3.MotorCtrl_FuncCode = 0x01;
	MotorCtrl_M3.MotorCtrl_ByteData = 0x01;		//06/07
	MotorCtrl_M3.MotorCtrl_DataCode = 0x000000;

	MotorInit_M3 = 1;	//init wait
	MotoCtrl_PackSend3();
	HAL_Delay(MOTOR_INIT_RETRY_MS);

	while (MotorInit_M3 != 2) {
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "M3 Init Wait ");
		HAL_Delay(MOTOR_INIT_RETRY_MS);
		MotoCtrl_PackSend3();
	}

	OLED_ShowString(OLED_I2C_ch, OLED_type, 13, 0, "3 ");	// 9 11 13 15
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "M3 Initialized! ");

	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "Y: ");
	itoa(M3_ID, str1, 16);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 4, 3, str1);
	itoa(TA531_RC1.TA531_RC_Y_act, str1, 10);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 8, 3, str1);

	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Check TouchPen! ");
	HAL_GPIO_WritePin(KL15_RELAY_GPIO_Port, KL15_RELAY_Pin, 1);	//F
	HAL_Delay(700);
	HAL_GPIO_WritePin(KL15_RELAY_GPIO_Port, KL15_RELAY_Pin, 0);	//F
	HAL_Delay(500);

	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "PuhUp Rst DispXY");
	HAL_Delay(500);

	if (SW_UP == 1)	////reset display xy
			{
		Sys_tune1();
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Hold Up 2s Reset");
		HAL_Delay(800);
		if (SW_UP == 1)	////reset display xy
				{
			Sys_tune1();
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Hold Up 1s Reset");
			HAL_Delay(800);
			Sys_tune1();
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Release & Reset");
			HAL_Delay(2000);

			if (SW_UP == 0)	// into reset display xy
					{
				OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1,
						"U/D/L/R Set X0Y0");
				HAL_Delay(800);
				OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, "X0:");
				OLED_ShowString(OLED_I2C_ch, OLED_type, 8, 2, "Y0:");

				while (SW_BUTTON == 0)	//no push down
				{
					SW_UP_pre = SW_UP;
					SW_DW_pre = SW_DW;
					SW_LEFT_pre = SW_LEFT;
					SW_RIGHT_pre = SW_RIGHT;
					SW_BUTTON_pre = SW_BUTTON;

					SW_UP = (HAL_GPIO_ReadPin(SW_UP_GPIO_Port, SW_UP_Pin) == 0);
					SW_DW = (HAL_GPIO_ReadPin(SW_DOWN_GPIO_Port, SW_DOWN_Pin)
							== 0);
					SW_LEFT = (HAL_GPIO_ReadPin(SW_LEFT_GPIO_Port, SW_LEFT_Pin)
							== 0);
					SW_RIGHT = (HAL_GPIO_ReadPin(SW_RIGHT_GPIO_Port,
							SW_RIGHT_Pin) == 0);
					SW_BUTTON = (HAL_GPIO_ReadPin(SW_BUTTON_GPIO_Port,
							SW_BUTTON_Pin) == 0);

