YanqiS/stm32temp1/main.c
					if ((SW_UP == 1) & (SW_UP_pre == 1)) {
						TA531_RC1.TA531_RC_X_trg = TA531_RC1.TA531_RC_X_act
								+ 10;

						TA531_RC1_fg = 2;
					} else if ((SW_UP == 1) & (SW_UP_pre == 0)) {
						TA531_RC1.TA531_RC_X_trg = TA531_RC1.TA531_RC_X_act + 2;

						TA531_RC1_fg = 2;
					} else if ((SW_DW == 1) & (SW_DW_pre == 1)) {
						TA531_RC1.TA531_RC_X_trg = TA531_RC1.TA531_RC_X_act
								- 10;

						if (TA531_RC1.TA531_RC_X_trg < 0) {
							TA531_RC1.TA531_RC_X_trg = 0;
						}
						TA531_RC1_fg = 2;
					} else if ((SW_DW == 1) & (SW_DW_pre == 0)) {
						TA531_RC1.TA531_RC_X_trg = TA531_RC1.TA531_RC_X_act - 2;

						if (TA531_RC1.TA531_RC_X_trg < 0) {
							TA531_RC1.TA531_RC_X_trg = 0;
						}
						TA531_RC1_fg = 2;
					} else if ((SW_LEFT == 1) & (SW_LEFT_pre == 0)) {
						TA531_RC1.TA531_RC_Y_trg = TA531_RC1.TA531_RC_Y_act - 2;

						if (TA531_RC1.TA531_RC_Y_trg < 0) {
							TA531_RC1.TA531_RC_Y_trg = 0;
						}
						TA531_RC1_fg = 2;
					} else if ((SW_LEFT == 1) & (SW_LEFT_pre == 1)) {
						TA531_RC1.TA531_RC_Y_trg = TA531_RC1.TA531_RC_Y_act
								- 10;

						if (TA531_RC1.TA531_RC_Y_trg < 0) {
							TA531_RC1.TA531_RC_Y_trg = 0;
						}
						TA531_RC1_fg = 2;
					} else if ((SW_RIGHT == 1) & (SW_RIGHT_pre == 0)) {
						TA531_RC1.TA531_RC_Y_trg = TA531_RC1.TA531_RC_Y_act + 2;

						TA531_RC1_fg = 2;
					} else if ((SW_RIGHT == 1) & (SW_RIGHT_pre == 1)) {
						TA531_RC1.TA531_RC_Y_trg = TA531_RC1.TA531_RC_Y_act
								+ 10;

						TA531_RC1_fg = 2;
					}

					MotoCtrl_PositionLoop(TA531_RC1.TA531_RC_X_trg,
							TA531_RC1.TA531_RC_Y_trg);
					HAL_Delay(MOTOR_LOOP_INTERVAL_MS);

					itoa(TA531_RC1.TA531_RC_X_trg, str1, 10);
					OLED_ShowString(OLED_I2C_ch, OLED_type, 3, 2, str1);
					itoa(TA531_RC1.TA531_RC_Y_trg, str1, 10);
					OLED_ShowString(OLED_I2C_ch, OLED_type, 11, 2, str1);
				}

				////push down
				ScreenSz_1.DispX0_32b = TA531_RC1.TA531_RC_X_trg;
				ScreenSz_1.DispX0[0] = TA531_RC1.TA531_RC_X_trg & 0xff;
				ScreenSz_1.DispX0[1] = (TA531_RC1.TA531_RC_X_trg >> 8) & 0xff;
				ScreenSz_1.DispX0[2] = (TA531_RC1.TA531_RC_X_trg >> 16) & 0xff;
				ScreenSz_1.DispX0[3] = (TA531_RC1.TA531_RC_X_trg >> 24) & 0xff;

				ScreenSz_1.DispY0_32b = TA531_RC1.TA531_RC_Y_trg;
				ScreenSz_1.DispY0[0] = TA531_RC1.TA531_RC_Y_trg & 0xff;
				ScreenSz_1.DispY0[1] = (TA531_RC1.TA531_RC_Y_trg >> 8) & 0xff;
				ScreenSz_1.DispY0[2] = (TA531_RC1.TA531_RC_Y_trg >> 16) & 0xff;
				ScreenSz_1.DispY0[3] = (TA531_RC1.TA531_RC_Y_trg >> 24) & 0xff;

				SPI_Flash_Start(Flash_SPI);
				SPI_Flash_WtritEnable();
				HAL_Delay(5);
					SPI_Flash_WriteSomeBytes(ScreenSz_1.DispX0, Sys_Addr_DispX0,
							sizeof(int));
					SPI_Flash_WaitNoBusy();
					HAL_Delay(1);
				SPI_Flash_WtritEnable();
				HAL_Delay(5);
					SPI_Flash_WriteSomeBytes(ScreenSz_1.DispY0, Sys_Addr_DispY0,
							sizeof(int));
					SPI_Flash_WaitNoBusy();
					HAL_Delay(1);
				uint8_t temp1[4];	//temp3,temp4;
				SPI_Flash_ReadBytes(temp1, Sys_Addr_DispX0, sizeof(int));

				if ((temp1[0] != ScreenSz_1.DispX0[0])
						|| (temp1[1] != ScreenSz_1.DispX0[1])
						|| (temp1[2] != ScreenSz_1.DispX0[2])
						|| (temp1[3] != ScreenSz_1.DispX0[3])) {
					OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1,
							"WriteFlash Err!");
					while ((temp1[0] != ScreenSz_1.DispX0[0])
							|| (temp1[1] != ScreenSz_1.DispX0[1])
							|| (temp1[2] != ScreenSz_1.DispX0[2])
							|| (temp1[3] != ScreenSz_1.DispX0[3])) {
						SPI_Flash_WtritEnable();
						HAL_Delay(5);
						SPI_Flash_WriteSomeBytes(ScreenSz_1.DispX0,
						Sys_Addr_DispX0, sizeof(int));
						HAL_Delay(5);
						SPI_Flash_ReadBytes(temp1, Sys_Addr_DispX0,
								sizeof(int));
					}
					OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1,
							"WriteFlash OK!");
				}

				SPI_Flash_ReadBytes(temp1, Sys_Addr_DispY0, sizeof(int));
				// ⬅️ | 改为 ||
				if ((temp1[0] != ScreenSz_1.DispY0[0])
						|| (temp1[1] != ScreenSz_1.DispY0[1])
						|| (temp1[2] != ScreenSz_1.DispY0[2])
						|| (temp1[3] != ScreenSz_1.DispY0[3])) {
					OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1,
							"WriteFlash Err!");
					while ((temp1[0] != ScreenSz_1.DispY0[0])
							|| (temp1[1] != ScreenSz_1.DispY0[1])
							|| (temp1[2] != ScreenSz_1.DispY0[2])
							|| (temp1[3] != ScreenSz_1.DispY0[3])) {
						SPI_Flash_WtritEnable();
						HAL_Delay(5);
						SPI_Flash_WriteSomeBytes(ScreenSz_1.DispY0,
						Sys_Addr_DispY0, sizeof(int));
						HAL_Delay(5);
						SPI_Flash_ReadBytes(temp1, Sys_Addr_DispY0,
								sizeof(int));
					}
					OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1,
							"WriteFlash OK!");
				}

				OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1,
						"U/D/L/R Set X1Y1");
				HAL_Delay(800);
				OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "X1:");
				OLED_ShowString(OLED_I2C_ch, OLED_type, 8, 3, "Y1:");

				while (SW_BUTTON == 0) {
					// UP键 - 渐进加速
					if (SW_UP == 1) {
						int step;
						if (SW_UP_cnt == 0) {
							step = 1;
						} else if (SW_UP_cnt < 8) {
							step = 5;
						} else if (SW_UP_cnt < 15) {
							step = 10;
						} else {
							step = 30;
						}
						TA531_RC1.TA531_RC_X_trg = TA531_RC1.TA531_RC_X_act + step;
						TA531_RC1_fg = 2;
					}

					// DOWN键 - 渐进加速
					else if (SW_DW == 1) {
						int step;
						if (SW_DW_cnt == 0) {
							step = 1;
						} else if (SW_DW_cnt < 8) {
							step = 5;
						} else if (SW_DW_cnt < 15) {
							step = 10;
						} else {
							step = 30;
						}
						TA531_RC1.TA531_RC_X_trg = TA531_RC1.TA531_RC_X_act - step;
						if (TA531_RC1.TA531_RC_X_trg < 0) {
							TA531_RC1.TA531_RC_X_trg = 0;
						}
						TA531_RC1_fg = 2;
					}

					// LEFT键 - 渐进加速
					else if (SW_LEFT == 1) {
						int step;
						if (SW_LEFT_cnt == 0) {
							step = 1;
						} else if (SW_LEFT_cnt < 8) {
							step = 5;
						} else if (SW_LEFT_cnt < 15) {
							step = 10;
						} else {
							step = 30;
						}
						TA531_RC1.TA531_RC_Y_trg = TA531_RC1.TA531_RC_Y_act - step;
						if (TA531_RC1.TA531_RC_Y_trg < 0) {
							TA531_RC1.TA531_RC_Y_trg = 0;
						}
						TA531_RC1_fg = 2;
					}

